app/controllers/defalut_items_controller.rb

SELECT `defalut_items`.* FROM `defalut_items`
---
  def index
    @defalut_items = DefalutItem.all