app/controllers/items_controller.rb

SELECT `items`.* FROM `items`
---
  def index
    @items = Item.all

SELECT `items`.* FROM `items` WHERE `items`.`id` = 12 LIMIT 1
---
  def show
    @item = Item.find(params[:id])

INSERT INTO `items` (`name`, `description`, `created_at`, `updated_at`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`) VALUES ('pappu', 'laddu', '2011-02-27 18:34:34', '2011-02-27 18:34:34', NULL, NULL, NULL, NULL)
---
  def create
    p params
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save